## GCP Terraform Checks


#### ✅ Terraform Format and Style Passed
#### ✅ Terraform Initialization Passed
#### ✅ Terraform Validation Passed
#### ✅ Terraform Plan Passed
<details>
<summary><code>terraform plan</code> output</summary>

```text
tls_private_key.key: Refreshing state... [id=287a606386244db7a3ae024b1597f8cbe6545b4e]
data.cloudflare_zone.site-zone: Reading...
data.cloudflare_zone.site-zone: Read complete after 0s [id=1896d1131a72f9255386a78c50024864]
data.google_compute_image.ubuntu: Reading...
google_compute_address.ip: Refreshing state... [id=projects/supernode-401805/regions/us-south1/addresses/ki5vmf-dallas-gcp]
cloudflare_record.supernode-record: Refreshing state... [id=bf5e365f62f45b0993551e2c80cb3503]
cloudflare_record.record: Refreshing state... [id=05fb67441050073eac7b22ae032fda25]
data.google_compute_image.ubuntu: Read complete after 1s [id=projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20231030]
google_compute_instance.default: Refreshing state... [id=projects/supernode-401805/zones/us-south1-b/instances/ki5vmf-dallas-gcp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.default must be replaced
-/+ resource "google_compute_instance" "default" {
      ~ cpu_platform              = "Intel Broadwell" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      ~ effective_labels          = {} -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "projects/supernode-401805/zones/us-south1-b/instances/ki5vmf-dallas-gcp" -> (known after apply)
      ~ instance_id               = "4172919567138873045" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      - labels                    = {} -> null
      ~ metadata_fingerprint      = "1MOYJrdu3GQ=" -> (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "ki5vmf-dallas-gcp"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/supernode-401805/zones/us-south1-b/instances/ki5vmf-dallas-gcp" -> (known after apply)
        tags                      = [
            "http-server",
            "https-server",
            "vtun-server",
            "vtun-supernode-server",
            "wireguard-server",
        ]
      ~ tags_fingerprint          = "YoV7qx0nLko=" -> (known after apply)
      ~ terraform_labels          = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/supernode-401805/zones/us-south1-b/disks/ki5vmf-dallas-gcp" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image                 = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20231025a" -> "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20231030" # forces replacement
              ~ labels                = {} -> (known after apply)
              - resource_manager_tags = {} -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/supernode-401805/global/networks/default" -> "default"
          ~ network_ip                  = "10.206.0.27" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/supernode-401805/regions/us-south1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project          = "supernode-401805" -> (known after apply)

          ~ access_config {
              ~ network_tier = "PREMIUM" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>